---
kind: property
id: P:Autodesk.Revit.DB.LinkConversionData.IsValidObject
source: html/b712ddbc-80e8-0431-1a1b-299ba2434d54.htm
---
# Autodesk.Revit.DB.LinkConversionData.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.